{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_34","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense100","trainable":true,"batch_input_shape":[null,63],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization67","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout67","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense101","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization68","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout68","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense102","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./gesture-model-weights.weights.bin"],"weights":[{"name":"dense_Dense100/kernel","shape":[63,128],"dtype":"float32"},{"name":"dense_Dense100/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization67/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization67/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense101/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense101/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization68/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization68/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense102/kernel","shape":[64,2],"dtype":"float32"},{"name":"dense_Dense102/bias","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization67/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization67/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization68/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization68/moving_variance","shape":[64],"dtype":"float32"}]}]}